server/app/Controllers/APIController.php

SELECT *
FROM `articles`
ORDER BY `created_at` DESC
---
    public function showAllArticles()
    {
        $articles = $this->articleModel->orderBy('created_at', 'DESC')->findAll();