server/app/Controllers/ArticlesController.php

    public function createArticle()
    {
        helper(['form', 'url', 'filesystem']);

        if ($this->request->getMethod() == 'POST') {
            $model = new ArticleModel();

            $data = [
                'title' => $this->request->getPost('title'),
                'content' => $this->request->getPost('content'),
            ];

            // Handle the image upload
            $img = $this->request->getFile('image');
            if ($img) {
                if ($img->isValid() && !$img->hasMoved()) {
                    $newName = $img->getRandomName();
                    $img->move('./uploads/articles', $newName);
                    $data['image'] = $newName; // Save the image name to the database
                } else {
                    echo 'Error uploading file: ' . $img->getErrorString() . '<br>';
                }
            } else {
                echo 'No file received.<br>';
            }

            if ($model->insert($data)) {
---
INSERT INTO `articles` (`title`, `content`, `image`) VALUES ('Nisi odio aliqua Qu', 'Dolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam oDolor aut qui quam o', '1716285268_6157491d942c3b78ff6a.jpg')

    public function editArticle($id)
{
    $model = new ArticleModel();

    $article = $model->find($id);
---
SELECT *
FROM `articles`
WHERE `articles`.`id` = '2'

public function updateArticle($id)
{
    $model = new ArticleModel();

        // Get the existing article data
        $article = $model->find($id);
---
SELECT *
FROM `articles`
WHERE `articles`.`id` = '2'