server/app/Controllers/AuthController.php

    public function processLogin()
    {
        $session = session();
        $model = new UserModel();

        // Get the email and password from the POST request
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Find the user by email
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1