server/app/Controllers/DashboardController.php

SELECT *
FROM `articles`
ORDER BY `created_at` DESC
SELECT *
FROM `article_images`
WHERE `article_id` = '8'
---
    public function index()
    {
        helper(['form', 'url', 'text_helper']); // Load the custom helper
    $articleModel = new ArticleModel();
    $articleImagesModel = new \App\Models\ArticleImagesModel();

    // Fetch all articles
    $articles = $articleModel->orderBy('created_at', 'DESC')->findAll();

    // Fetch and associate images for each article
    foreach ($articles as &$article) {
        // Fetch images associated with the current article
        $images = $articleImagesModel->where('article_id', $article['id'])->findAll();